<template>
  <div class="main">
    <h1>活動内容</h1>京大アンプラグドの主な活動は大きく「例会」、「ライブ」、「その他イベント」に分けられます。
    <h2>例会</h2>
    <p>
      普段は例会教室での個人練習や、バンドの合わせをメインに活動しています。<br>
      教室は吉田南構内の4共の21や30,31を使います。例会教室はほぼ毎日使用でき、18:15から翌朝5:00まで自由に楽器を演奏できるので、練習場所に困ることはありません。 <br>
      ライブ前やNF(11月祭)前は、多くの人が個人練習や合わせを例会教室で行っており、とても活発です！
    </p>
    <h2>ライブ</h2>
    <p>
      京大アンプラグドではさまざまなライブを目標に練習しています。<br>
      例会教室で行う月例ライブを始めとして、1回生が主役となる新人ライブやクリスマスライブがあります。これらは全て自由参加なので、自分のスケジュールに合わせてサークル活動を行えます。<br>
      最大のライブは、京都大学の学園祭であるNFです。 4日間を通して多くの曲を路上ライブで行います。 2019年度のNFでは4日間で200曲程演奏しました。 <br>
      アンプラでは基本的に固定バンドを組まず、曲ごとに編成を変えて演奏する形なので幅広いジャンルをいろんな人と演奏できます。<br>
    </p>
    <p class="link-next">
      <nuxt-link to="/movie">
        <font-awesome-icon icon="arrow-alt-circle-right" />過去のライブで演奏された曲を見る
      </nuxt-link>
    </p>
    <!-- TODO: LiveLogに変える...? -->
    <!-- <p class="link-next">
      <a href="http://ku-unplugged.net/old/lives/live_index.html" target="_blank">
        <font-awesome-icon icon="arrow-alt-circle-right" />過去のライブで演奏された曲を見る
      </a>
    </p> -->
    <!-- movieページができあがったらとりあえずそっちに -->
    <h2>その他イベント</h2>
    <p>
      京大アンプラグドではライブ以外のイベントも充実しています。
    </p>
    <h6>コンパ</h6>
    <p>
      他サークルと同様にコンパが定期的に開催されます。アンプラでは未成年はもちろん、誰にも飲酒を強要する事はないのでみんなが自分のペースで楽しめます。
    </p>
    <h6>夏合宿</h6>
    <p>
      1年間で最大のイベントです。2019年度は石川県に行き、3泊4日で宿を貸し切り音楽に浸りました。夏合宿では、くじで全回生混合のバンドを組み、最終日にライブをします。 その間にも花火やBBQ、室内レク、屋外レク....など様々なイベントがありました。
    </p>
    <h6>春合宿</h6>
    <p>
      音楽から少し離れた観光目的での合宿を行います。2019年度は2泊3日で鳥取島根への合宿を予定していました。(コロナウイルスの影響で中止)
    </p>
    <h6>その他</h6>
    <p>
      BBQや例会教室でのレクリエーションを行います。(不定期開催)
    </p>
    <h2>年間予定</h2>
    <table border="1">
      <tbody>
        <tr>
          <th>月</th>
          <th>イベント</th>
        </tr>
        <tr>
          <td>4月</td>
          <td>
            花見
            新歓ライブ
          </td>
        </tr>
        <tr>
          <td>5月</td>
          <td>
            新歓ライブ
            バーベキュー
            新歓コンパ
          </td>
        </tr>
        <tr>
          <td>6月</td>
          <td>6月ライブ</td>
        </tr>
        <tr>
          <td>7月</td>
          <td>
            新人ライブ
            （テスト）
          </td>
        </tr>
        <tr>
          <td>8月</td>
          <td>
            前期おつコン
            夏合宿
          </td>
        </tr>
        <tr>
          <td>9月</td>
          <td>同志社P.Sと合同ライブ</td>
        </tr>
        <tr>
          <td>10月</td>
          <td>10月ライブ</td>
        </tr>
        <tr>
          <td>11月</td>
          <td>NF(路上ライブ)</td>
        </tr>
        <tr>
          <td>12月</td>
          <td>
            忘年会
            クリスマスライブ
          </td>
        </tr>
        <tr>
          <td>1月</td>
          <td>
            あけおめライブ(2016年度)
            （テスト）
          </td>
        </tr>
        <tr>
          <td>2月</td>
          <td>
            幹部選出
            後期おつコン
            冬合宿
          </td>
        </tr>
        <tr>
          <td>3月</td>
          <td>
            3月ライブ
            卒業ライブ
            追いコン
          </td>
        </tr>
      </tbody>
    </table>
  </div>
</template>
<style scoped>
h6 {
  margin-left: 20px;
}
table {
  margin-left: 20px;
  margin-bottom: 2rem;
}
</style>
