<template>
  <div class="main">
    <h1>入会するには</h1>
    <p>
      京大アンプラグドは京大に限らず、大学生であれば誰でも入ることができます。
      <br />2015年度では、京都女子大学、京都造形芸術大学、関西大学などから,
      <br />2016年度では, 大阪芸術大学, 京都教育大学, 京都工芸繊維大学 , 京都造形芸術大学, 京都府立医科大学, 神戸女学院, 同志社大学 などから,
      <br />2017年度では、同志社大学、立命館大学、京都造形芸術大学などから,アンプラに来ている人もいます。
      <br />自宅生の会員も多くいます。
      <br />また、回生も問わず、何回生でも構いません。2回生、3回生から入会する人もいます。
      <br />入会時期も特に定めておらず、秋入会も可能です。
      <br />
      <br />
      <br />入ってからは、何らかの楽器を担当するわけですが、
      <br />その楽器の経験の有無も問いません。
      <br />アンプラに入って初めて楽器を始める人, 新たに別の楽器を始める人も多くいます。
      <br />
      <br />
      <br />兼サークルに関しても止めることはありません。
      <br />ただし、アンプラだけでも暇ということは決してなく、
      <br />十分に打ち込むことのできるサークルなので、
      <br />あまり忙しいサークルと掛け持つと、どちらかがおろそかになるかもしれないです。
      <br />
      <br />
      <br />最後に会費ですが、1,2回生は半期3000円、3回生以上は任意ということになっています。
      <br />他に参加するならば、コンパ代、各ライブの打ち上げ費、合宿費等がかかります。
      <br />
      <link-next href="/contacts" text="入会希望・質問は「お問い合わせ」で！" />
    </p>
  </div>
</template>
<script>
// <link-next href="url..." text="もじ..." /> で, <a href="url...">→もじ...</a> を生成する.(矢印はfontawesomeのやつ)
// 実際には, nuxt-link を呼び出しているためサイト内遷移は爆速.
import linkNext from '~/components/link-next.vue'
export default {
  components: {
    linkNext
  }
}
</script>
