<template>
  <div class="main">
    <h1>入会するには</h1>
    <p>
      京大アンプラグドは京大に限らず、京都女子大学、同志社大学、立命館大学など、大学生であれば誰でも入ることができます。
      <br />また、回生も問わず、何回生でも構いません。2回生、3回生から入会する人もいます。
      <br />入会時期も基本的には春ですが、場合によっては秋入会も可能です。
      <br />
      <br />入ってからは、何らかの楽器を担当することになりますが、その楽器の経験の有無も問いません。アンプラに入って初めて楽器を始める人、新たに別の楽器を始める人も多くいます。
      <br />
      <br />兼サークルに関しても止めることはありません。実際に、他の軽音サークルや、異なる種類のサークルと兼サークルをしている会員も多くいます。
      <br />ただし、アンプラだけだと暇だということは決して無く、十分に打ち込むことのできるサークルとなっています！
      <br />
      <br />最後に会費ですが、入会費3000円、1,2,3年目は半期3000円、4年目以上は任意ということになっています。
      <br />その他に、コンパや合宿に参加する方についてはその費用がかかります。
      <br />
      <br /><link-next href="/contacts" text="入会希望・質問は「お問い合わせ」で！" />
    </p>
  </div>
</template>
<script>
// <link-next href="url..." text="もじ..." /> で, <a href="url...">→もじ...</a> を生成する.(矢印はfontawesomeのやつ)
// 実際には, nuxt-link を呼び出しているためサイト内遷移は爆速.
import linkNext from '~/components/link-next.vue'
export default {
  components: {
    linkNext
  }
}
</script>
