<template>
  <div class="main">
    <h1>“アンプラグド”とは</h1>
    <h2>サークル名の由来は？</h2>
    <p>
      「アンプラグド(Unplugged)」とは、直訳で「プラグを抜いた」という意味になります。
      <br />そこから、電気を用いないアコースティック楽器を用いた音楽全般を指す言葉にもなっています。
      <br />きっかけはアメリカのテレビ番組「MTVアンプラグド」、
      <br />さらにその番組からエリック・クラプトンが発表したアルバム"Unplugged"により
      <br />「アンプラグド」ブームが起こりました。
      <br />京大アンプラグドもそんなアコースティックブームの中で生まれたサークルです。
      <br />ちなみに、京大アンプラグド所属者はサークルのことを「アンプラ」と呼んでいます。
    </p>
    <h2>どんな楽器がアンプラグド？</h2>
    <p>
      京大アンプラグドは当初、楽器はアコギだけのサークルでした。
      <br />そこから「アンプラグド」の名の下、様々なアコースティック楽器を扱うようになります。
      <br />現在では、ボーカル、アコースティックギター、ピアノ、ベース、パーカッションはカホンを中心に、
      <br />ヴァイオリン・チェロといった弦楽器、
      <br />フルート・サックス・トランペット等の管楽器、
      <br />南米・アフリカ等の民族楽器、
      <br />打楽器もボンゴやタンバリンなどなど、様々な楽器を扱っています。
      <br />
    </p>
    <h2>どこまでアンプラグド？</h2>
    <p>
      「プラグを抜いた」といっても、当然ライブではスピーカーを通すことになります。
      <br />そこではマイクやアンプも使いますしライブPAもいます。
      <br />さらに、ベースに関してはさすがにウッドベースを学校で持ち歩くわけには行かないので、
      <br />エレクトリック・ベースが基本になっていますし（それでも、もちろんウッドベース奏者はいます！）、
      <br />ピアノはサークルで電子ピアノを所有しています。
      <br />しかし、これらは現実的に仕方の無い事情からなる特例で、
      <br />ベースはエフェクターを通さず、ピアノもピアノの音色以外で使うことはありません。
      <br />他にも、普通の軽音サークルでは当たり前に使っている
      <br />エレキギター・シンセサイザー・各種エフェクター、
      <br />これらがアンプラグドで用いられたことはありません。
      <br />実際、どこまでがアンプラグドなのかというルールはサークルには無く、
      <br />各人それぞれに「アンプラグド」の解釈があります。
    </p>
    <h2>アンプラグドのメリットは？</h2>
    <p>
      おそらく、エレキギターの歪んだサウンドに慣れたバンド経験者からすると、
      <br />アコギしか使わない「アンプラグド」は想像しがたいと思います。
      <br />確かに、現代の音楽をやる上で電子音を使わない、というのは難しいところもあります。
      <br />しかし、だからこそアコースティックにアレンジする楽しさがあり、
      <br />また、「アンプラグド」の制限があるからこそ、その中で様々な可能性を探る面白さがあるのです。
      <br />それに音楽ジャンルに関しても、1940年ごろから欧米で勃興したバンド音楽だけでなく、
      <br />様々な時代の、それこそ世界中の音楽が、演奏者さえいれば可能です。
      実際、アンプラほど多彩な編成が可能な軽音サークルはそうそうないでしょう。
      <br />そして、それは大学という巨大なコミュニティに所属している間にしかできないのです。
      <br />
    </p>
  </div>
</template>
